tests/data/get_protocol_info.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <SOAP-ENV:Body>
        <m:GetProtocolInfo xmlns:m="urn:schemas-upnp-org:service:ConnectionManager:1">"
        </m:GetProtocolInfo>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope
